КАКерамика_моя_старая_база/src/Documents/Ремонт/Ремонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ремонт</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.Рекламация</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерОсуществляетРемонт</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВРемонт</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратИзРемонта</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительОС</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дефект</name>
      <type>
        <types>CatalogRef.ОписанияДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Фото</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Работы</name>
      <type>
        <types>CatalogRef.РемонтРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/СтатусыРемонт/СтатусыРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонт</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/Ремонт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Пропускаем обработку, чтобы гарантировать получение формы объекта при передаче параметра "АвтоТест".
	Если ДанныеЗаполнения = "АвтоТест" 
		ИЛИ ДанныеЗаполнения = Неопределено
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Ответственный	= Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Для каждого ДокОснование Из ДанныеЗаполнения Цикл
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Рекламация") Тогда
				Организация		= ДокОснование.Организация;
				Партнер			= ДокОснование.Партнер;
				Основание		= ДокОснование;
				Для каждого Т Из ДокОснование.Товары Цикл
					НоваяСтрока = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Организация		= ДанныеЗаполнения.Организация;
		Партнер			= ДанныеЗаполнения.Партнер;
		Основание		= ДанныеЗаполнения;
		
		Для каждого Т Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
		КонецЦикла;
	КонецЕсли;
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыРемонт.ВРаботе
		И ЗначениеЗаполнено(ПриемкаВРемонт) Тогда
		
		Движения.СвободныеОстатки.Записывать = Истина;
		Для Каждого Т Из Товары Цикл

			СвободныйОстаток = ПолучитьСвободныйОстаток(Т.Номенклатура, ПриемкаВРемонт);
			
			Если СвободныйОстаток < Т.Количество Тогда
				Сообщить("Номенклатура: " + Т.Номенклатура);
				Сообщить("Требуется: " + Т.Количество);
				Сообщить("Свободный остаток: " + СвободныйОстаток);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = Движения.СвободныеОстатки.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= ПриемкаВРемонт;
			Движение.ВРезервеСоСклада	= Т.Количество;
		КонецЦикла;

		Движения.ТоварыКОтгрузке.Записывать = Истина;
		Для Каждого Т Из Товары Цикл
			Движение = Движения.ТоварыКОтгрузке.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Период				= Дата;
			Движение.ДокументОтгрузки	= Ссылка;
			Движение.Номенклатура		= Т.Номенклатура;
			Движение.Склад				= ПриемкаВРемонт;
			Движение.ВРезерве			= Т.Количество;
		КонецЦикла;
	Иначе
		ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	//ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	//ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	//ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	//ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();	
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область Дополнительно

Функция ПолучитьСвободныйОстаток(п_Номенклатура, п_Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
		|ГДЕ
		|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
		|	И СвободныеОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	Запрос.УстановитьПараметр("Склад", п_Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Остаток;
	КонецЦикла;
	
	Возврат 0;

КонецФункции // ()

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры
	
#КонецОбласти
